Repository: workbenchdev/Workbench
Catalog: po/*.po
Languages: ar, fr, nl, pt_br, tr

source: Workbench
ar: منضدة

source: Learn and prototype with GNOME technologies
ar: تعلم وصمم نماذجًا بتقنيات GNOME
fr: Apprendre et construire avec les technologies GNOME
nl: Leer en experimenteer met Gnome-technologieën
pt_br: Aprenda e prototipe com tecnologias GNOME

source: Workbench goal is to let you experiment with GNOME technologies, no matter if tinkering for the first time or building and testing a GTK user interface.
ar: هدف Workbench هو تمكينك من تجربة تقنيات GNOME، بغض النظر عمّا إذا كنت تقوم بتجربتها لأول مرة أو بناء واختبار واجهة GTK.
fr: Le but de Workbench est de vous laisser expérimenter les technologies GNOME, que ce soit pour bidouiller pour la première fois ou pour construire et tester une interface GTK personnalisé.
nl: Het doel van Workbench is om u te laten experimenteren met Gnome-technologieën, of u nu voor de eerste keer sleutelt, of een GTK-interface bouwt en test.
pt_br: O objetivo do Workbench é permitir que você experimente as tecnologias GNOME, não importando se é um novato ou se já mantem e testa um widget GTK personalizado.

source: Among other things, Workbench comes with
ar: من بين أمور أخرى ، يأتي Workbench مع
fr: Workbench comporte entre autres
nl: Workbench bevat onder andere de volgende functies:
pt_br: Entre outras coisas, Workbench vem com
tr: Diğer şeylerin yanı sıra, Workbench bunlarla birlikte gelir:

source: realtime GTK/CSS preview
ar: عرض مباشر لـ GTK و CSS
fr: prévisualisation GTK / CSS en temps réel
nl: Realtime GTK-/CSS-voorvertoning
pt_br: visualização de GTK/CSS em tempo real
tr: gerçek zamanlı GTK/CSS önizlemesi

source: library of examples
ar: مكتبة من الأمثلة
fr: bibliothèque d'exemples
nl: Een bibliotheek met voorbeelden
pt_br: Biblioteca de exemplos

source: XML and Blueprint for describing user interface
ar: XML و Blueprints لصنع واجهة المستخدم
fr: XML et Blueprint pour décrire l'interface utilisateur
nl: XML en Blueprint voor het beschrijven van de gebruikersinterface
pt_br: XML e Blueprint para descrever a interface do usuário

source: syntax highlighting, undo/redo, autosave, session restore
ar: تمييز بناء الجملة ، تراجع / إعادة الخطوات ، الحفظ التلقائي ، استعادة الجلسة
fr: surlignage syntaxique, fonctions annuler / refaire, sauvegarde automatique, restaurer la session
nl: Syntaxis-accentuering, ongedaan maken/opnieuw, automatisch opslaan, sessie herstellen
pt_br: Realce de sintaxe, desfazer/refazer, salvamento automático, restauração da sessão

source: code formatter
ar: منسق التعليمات البرمجية
fr: formateur de code
nl: Code-formateerder
pt_br: Formatador de código
tr: kod formatlayıcı

source: console logs
ar: السجلات
fr: Journaux de console
nl: Console-logboeken
pt_br: logs do console
tr: konsol logları

source: Improve application design
ar: تحسين تصميم التطبيق
fr: Amélioration de la conception des applications
nl: Toepassingsontwerp verbeterd
pt_br: Melhorar o design do aplicativo

source: Highlights
ar: اهم الميزات
fr: Points clés
nl: Hoogtepunten
pt_br: Destaques

source: Add Blueprint markup syntax for UI
ar: أضف بنية ترميز Blueprint لواجهة المستخدم
fr: Ajout de la syntaxe de balisage Blueprint pour l'interface utilisateur
nl: Blueprint-opmaaksyntaxis toegevoegd voor interfaces
pt_br: Adicionar marcação Blueprint para a interface do usuário

source: Add Vala programming language for Code
ar: أضف لغة البرمجة Vala
fr: Ajout du langage de programmation Vala pour le code
nl: Vala-programmeertaal toegevoegd voor code
pt_br: Adicionar a linguagem de programação Vala ao código

source: Add support for previewing templates
ar: أضف دعمًا لمعاينة القوالب
fr: Ajout du support pour prévisualiser les templates
nl: Ondersteuning toegevoegd voor het voorvertonen van sjablonen
pt_br: Adicionar suporte para modelos de pré-visualização

source: Add support for previewing signal handlers
ar: إضافة دعم لمعاينة معالجات الإشارة
fr: Ajout du support pour prévisualiser les gestionnaires de signaux
nl: Ondersteuning toegevoegd voor het voorvertonen van signaalafhandelaars
pt_br: Adicionar suporte para pre-visualizar gerenciadores de sinais

source: Include all icons from icon-development-kit
ar: قم بتضمين جميع الأيقونات من مجموعة تطوير الأيقونات
fr: Inclusion de toutes les icônes de icon-development-kit
nl: Alle pictogrammen van icon-development-kit bijgevoegd
pt_br: Incluir todos os ícones do kit de desenvolvimento de ícones

source: Distribute Library examples under CC0-1.0
ar: توزيع أمثلة المكتبة تحت CC0-1.0
fr: Distribution de la bibliothèque d'exemple sous la license CC0-1.0
nl: Bibliotheekvoorbeelden uitgebracht onder CC0-1.0
pt_br: Distribuir Bibliotecas de exemplos pela licença CC0-1.0

source: Respect system preference for color scheme
ar: احترم تفضيل النظام لنظام الألوان
fr: Respect de la préférence système pour les couleurs de l'application
nl: Systeemvoorkeur voor kleurenschema wordt respecteerd
pt_br: Respeitar a preferência do sistema para o esquema de cores

source: Add proper light/dark color schemes for Console
ar: أضف أنظمة ألوان فاتحة / داكنة مناسبة لوحدة التحكم
fr: Ajout des couleurs claires/sombres approriées pour la Console
nl: Degelijke lichte en donkere kleurenschema's voor console toegevoegd
pt_br: Adicionar esquemas de cores claro/escuro próprios para o Console

source: Other changes
ar: تغييرات أخرى
fr: Autres changements
nl: Andere wijzigingen
pt_br: Outras mudanças

source: Silence platform tools
ar: أدوات نظام الصمت
fr: Taire l'outil de la plateforme
nl: Platformgereedschap gedempt
pt_br: Ferramentas da plataforma de silêncio

source: Make Library examples only open relevant panels
ar: اجعل أمثلة المكتبة تفتح اللوحات ذات الصلة فقط
fr: Fait n'ouvrir que les panneaux importants à la bibliothèque d'exemples
nl: Ervoor gezorgd dat bibliotheekvoorbeelden alleen relevante panelen openen
pt_br: Fazer que os exemplos de biblioteca apenas abram painéis relevantes

source: Always open the Console when opening a Library example
ar: افتح لوحة التحكم دائمًا عند فتح مثال مكتبة
fr: Toujours ouvrir la console à l'ouverture d'une bibliothèque d'exemple
nl: Console wordt altijd geopend wanneer een bibliotheekvoorbeeld wordt geopend
pt_br: Sempre abrir o Console ao abrir uma biblioteca-exemplo

source: Prevent running Code if the panel is not visible
ar: منع تشغيل الكود إذا كانت اللوحة غير مرئية
fr: Ne pas lancer le code si le panneau n'est pas visible
nl: Code wordt weerhouden van uitvoeren als het paneel niet zichtbaar is
pt_br: Impedir a execução do código se o painel não estiver visível

source: Add icons and mnemonics for all buttons
ar: إضافة أيقونات وفن الإستذكار لجميع الأزرار
fr: Ajouter des icônes et des mnémotechniques pour tous les boutons
nl: Pictogrammen en toetsaanwijzingen voor alle knoppen toegevoegd
pt_br: Adicionar ícones e mnemônicos para todos os botões

source: Move Bookmarks to the main menu
ar: نقل الإشارات المرجعية إلى القائمة الرئيسية
fr: Déplacer les marque-pages dans le menu principal
nl: Bladwijzers naar het hoofdmenu verplaatst
pt_br: Mover Favoritos para o menu principal

source: Enable scrollbar and kinetic scrolling on Console
ar: تفعيل شريط التمرير والتمرير الحركي على وحدة التحكم
fr: Activer la barre de défilement et le défilement cinétique sur la console
nl: Scrollbalk en kinetisch scrollen toegevoegd aan console
pt_br: Habilitar barra de rolagem no Console

source: Improve Library examples
ar: تحسين أمثلة المكتبة
fr: Améliorer les bibliothèques d'exemple
nl: Bibliotheekvoorbeelden verbeterd
pt_br: Melhorar os Exemplos da Biblioteca

source: Performance optimizations
ar: تحسين الأداء
fr: Optimisations de performance
nl: Prestatieverbeteringen
pt_br: Otimizações de desempenho

source: Show a placeholder when all panels are invisible
ar: إظهار عنصر نائب عندما تكون كل اللوحات غير مرئية
fr: Afficher un placeholder quand tous les panneaux sont invisibles
nl: Een placeholder wordt getoond wanneer alle panelen onzichtbaar zijn
pt_br: Mostrar um marcador de posição para os painéis visíveis

source: Crash fixes
ar: إصلاحات الأعطال
fr: Diverses corrections
nl: Crashoplossingen
pt_br: Correções de falhas

source: Use org.gnome.Sdk runtime
ar: استخدم وقت تشغيل org.gnome.Sdk
fr: Utiliser org.gnome.Sdk
nl: De runtime org.gnome.Sdk gebruikt
pt_br: Usar org.gnome.Sdk

source: Add a Library of examples
ar: أضف مكتبة من الأمثلة
fr: Ajouter une bibliothèque d'exemples
nl: Bibliotheek met voorbeelden toegevoegd
pt_br: Adicionar biblioteca de exemplos

source: Add an example of WebSocket client
ar: أضف مثالاً لعميل WebSocket
fr: Ajouter un exemple de client WebSocket
nl: Voorbeeld van WebSocket-cliënt toegevoegd
pt_br: Adicionar um exemplo de cliente WebSocket

source: Add an example of toasts
ar: أضف مثال على شرب النخب
fr: Ajouter un exemple d'avis
nl: Toasts-voorbeeld toegevoegd
pt_br: Adicionar um exemplo de avisos

source: Add an example of application window
ar: أضف مثالاً لنافذة التطبيق
fr: Ajouter un exemple de fenêtre d'application
nl: Voorbeeld van toepassingsvenster toegevoegd
pt_br: Adicionar um exemplo de janela de aplicação

source: Add an example of desktop notification
ar: أضف مثالاً على تنبيه سطح المكتب
fr: Ajouter un exemple de notification de bureau
nl: Voorbeeld van bureaubladnotificatie toegevoegd
pt_br: Adicionar umexemplo de notificação de área de trabalho

source: Add Adwaita Demo, GTK Demo, GTK Widget Factory and GTK Icon Browser
ar: اضف Adwaita Demo, GTK Demo, GTK Widget Factory و GTK Icon Browser
fr: Ajouter Adwaita Demo, GTK Demo, GTK Widget Factory et GTK Icon Browser
nl: Adwaita-demo, GTK-demo, GTK-widgetfabriek en GTK-pictogrambrowser toegevoegd
pt_br: Adicionar Adwaita Demo, GTK Demo, GTK Widget Factory e GTK Icon Browser

source: The Console can be collapsed by resizing it
ar: يمكن تصغير وحدة التحكم عن طريق تغيير حجمها
fr: La console peut être réduite en la redimensionnant
nl: De console kan worden ingevouwen door de grootte aan te passen
pt_br: O Console pode ser recolhido quando redimensionado

source: Prevent system.exit from quitting Workbench
ar: منع system.exit من الخروج من Workbench
fr: Empêcher system.exit de quitter Workbench
nl: Voorkomen dat system.exit Workbench sluit
pt_br: Impedir que system.exit saia do Workbench

source: Allow calling GObject.registerClass multiple times
ar: السماح باستدعاء GObject.registerClass عدة مرات
fr: Autoriser l'appel à GObject.registerClass plusieurs fois
nl: GObject.registerClass meerdere keren aanroepen wordt toegestaan
pt_br: Permitir chamar GObject.registerClass várias vezes

source: Prevent crash caused by using non GtkBuildable objects
ar: منع العطل الناتج عن استخدام اغراض غير GtkBuildable
fr: Empêcher le crash causé par l'utilisation d'objets non GtkBuildable
nl: Crash voorkomen door het gebruik van niet-GtkBuildable-objecten
pt_br: Prevenir travamentos causados pelo uso de objetos não GtkBuildable

source: Allow using DBus and Gio.Application
ar: السماح باستخدام DBus و Gio.Application
fr: Autoriser l'utilisation de DBus et Gio.Application
nl: Gebruik van DBus en Gio.Application toegestaan
pt_br: Permitir uso do DBus e Gio.Applicaton

source: Allow using network
ar: السماح باستخدام الشبكة
fr: Autoriser l'utilisation du réseau
nl: Gebruik van netwerk toegestaan
pt_br: Permitir o uso da rede

source: Enable GtkWindow objects preview
ar: تفعيل معاينة اغراض GtkWindow
fr: Activer la prévisualisation des objets GtkWindow
nl: GtkWindow-objectvoorvertoning toegestaan
pt_br: Ativar visualização de objetos GtkWindow

source: Take a png screenshot of the preview
ar: خذ لقطة شاشة بتنسيق png للعرض مسبق
fr: Prendre une capture d'écran PNG de la prévisualisation
nl: Een png-schermafdruk van het voorbeeld nemen toegestaan
pt_br: Fazer uma captura PNG da tela de pré-visualização
tr: Önizlemenin png görüntüsünü al

source: The console is now resizable
ar: وحدة التحكم الآن يمكن تغيير حجمها
fr: La console est désormais redimensionnable
nl: Het mogelijk gemaakt de grootte van de console te veranderen
pt_br: O console agora é redimensionável
tr: Konsol artık yeniden boyutlandırılabilir

source: Redesign the dark/light mode switcher
ar: أعد تصميم مبدل الوضع الداكن / الفاتح
fr: Refonte du bouton mode sombre / mode clair
nl: De schakelaar voor donkere/lichte modus herontworpen
pt_br: Redesenhar o comutador de modo escuro/claro
tr: Karanlık/ışık modu değiştiricisini yeniden tasarlayın

source: Show platform and dependencies in about dialog
ar: عرض النظام الأساسي والتبعيات في حول الحوار
fr: Affiche la plateforme et les dépendances dans le dialogue "À propos"
nl: Platform en afhankelijkheden aan over-dialoog toegevoegd
pt_br: Mostrar a plataforma e dependências no diálogo "Sobre"
tr: Hakkında iletişim kutusunda platformu ve bağımlılıkları göster

source: Update to GNOME platform 42
ar: التحديث إلى منصة GNOME 42
fr: Mise à jour vers la plateforme GNOME 42
nl: Geüpdate naar Gnome-platform 42
pt_br: Atualizar para a plataforma GNOME 42
tr: GNOME platform 42'ye güncelle

source: Various fixes
ar: إصلاحات مختلفة
fr: Diverses corrections
nl: Verscheidene foutoplossingen
pt_br: Várias correções
tr: Çeşitli düzeltmeler

source: This is the first release of Workbench. We hope you like it.
ar: هذا هو الإصدار الأول من Workbench. نأمل أن تنال إعجابكم.
fr: Ceci est la première version de Workbench. Nous espérons que vous l'apprécierez.
nl: Dit is de eerste uitgave van Workbench. We hopen dat u er tevreden mee bent.
pt_br: Esta é a primeira versão do Workbench. Esperamos que você goste.
tr: Bu, Workbench'in ilk sürümüdür. Umarız beğenirsin.

source: translator-credits
ar: إعتمادات المترجم
fr: Irénée THIRION
nl: Philip Goto
pt_br: Gustavo Costa <xfgusta@gmail.com>
tr: Emin Fedar<eminfedar@gmail.com>

source: Import File
ar: استيراد ملف
fr: Importer un fichier
nl: Bestand importeren
pt_br: Importar arquivo

source: All supported
ar: كله الدعم
fr: Tous supportés
nl: Alle ondersteunde
pt_br: Todos os suportados

source: Run Code
ar: قم بتشغيل الكود
fr: Exécuter le Code
nl: Code uitvoeren
pt_br: Executar Código

source: Open Library
ar: افتح المكتبة
fr: Ouvrir la Bibliothèque
nl: Bibliotheek openen
pt_br: Abrir a Biblioteca

source: Toggle Console
ar: تفعيل و ايقاف وحدة التحكم
fr: Ouvrir/fermer la Console
nl: Console omschakelen
pt_br: Fechar Console

source: Clear Console
ar: تفريغ وحدة التحكم
fr: Effacer la Console
nl: Console wissen
pt_br: Limpar Console
tr: Konsolu Temizle

source: Inspector
ar: المتفحص
fr: Inspecteur
pt_br: Inspetor
tr: Denetçi

source: Undo
ar: تراجع عن الإجراء
fr: Annuler
nl: Ongedaan maken
pt_br: Desfazer

source: _Library
ar: _مكتبة
fr: _Bibliothèque
nl: _Bibliotheek
pt_br: _Biblioteca

source: Open Library of Demos and Examples (Ctrl+Shift+O)
ar: افتح مكتبة العروض التوضيحية والأمثلة (Ctrl + Shift + O)
fr: Ouvrir la Bibliothèque des Démonstrations et Exemples (Ctrl+Maj+O)
nl: Bibliotheek met demo's en voorbeelden openen (Ctrl+Shift+O)
pt_br: Abrir a biblioteca de demonstrações e exemplos (Ctrl+Shift+O)
tr: Demolar ve Örnekler Kitaplığını Açın (Ctrl+Shift+O)

source: _Code
ar: الكود
pt_br: _Código

source: _Style
ar: _أسلوب
nl: _Stijl
pt_br: E_stilo

source: _UI
ar: _واجهة المستخدم
nl: _Interface
pt_br: _IU

source: _Preview
ar: _عرض مسبق
fr: _Prévisualisation
nl: _Voorbeeld
pt_br: _Pré-visualizar

source: Switch document
ar: تبديل الوثيقة
fr: Ouvrir/fermer le document
nl: Van document wisselen
pt_br: Alternar documento

source: _Run
ar: _يجري
fr: _Exécuter
nl: _Uitvoeren
pt_br: _Executar

source: Run (Ctrl+⏎)
ar: تشغيل (Ctrl + ⏎)
fr: Exécuter (Ctrl+⏎)
nl: Uitvoeren (Ctrl+⏎)
pt_br: Executar (Ctrl+⏎)
tr: Çalıştır (Ctrl+⏎)

source: Convert to XML
ar: تحويل إلى XML
fr: Convertir en XML
nl: Naar XML converteren
pt_br: Converter para XML

source: Convert to Blueprint
ar: قم بالتحويل إلى مخطط
fr: Convertir en Blueprint
nl: Naar Blueprint converteren
pt_br: Converter em Blueprint

source: <b>Preview</b>
ar: <b>معاينه</b>
fr: <b>Prévisualisation</b>
nl: <b>Voorbeeld</b>
pt_br: <b>Visualizar</b>

source: Take Screenshot of Preview
ar: خذ لقطة شاشة للعرض المسبق
fr: Prendre une capture d'écran de la Prévisualisation
nl: Schermafdruk van voorbeeld nemen
pt_br: Fazer captura de tela da visualização
tr: Önizlemenin Ekran Görüntüsünü Al

source: Windowed Preview
ar: عرض مسبق في وضعية اطار
fr: Prévisualisation fenêtrée
nl: Voorbeeld in venster
pt_br: Visualização em janela
tr: Pencereli Önizleme

source: Show Preview Window
ar: إظهار نافذة العرض المسبق
fr: Afficher la fenêtre de prévisualisation
nl: Voorbeeldvenster tonen
pt_br: Mostrar Janela de Visualização

source: Close Preview Window
ar: أغلق نافذة العرض المسبق
fr: Fermer la fenêtre de prévisualisation
nl: Voorbeeldvenster sluiten
pt_br: Fechar janela de visualização

source: C_onsole
ar: وحدة التحكم

source: Show logs (Ctrl+Shift+K)
ar: إظهار السجلات (Ctrl + Shift + K)
fr: Afficher les journaux (Ctrl+Maj+K)
nl: Logboeken tonen (Ctrl+Shift+K)
pt_br: Exibir logs (Ctrl+Shift+K)
tr: Logları göster (Ctrl+Shift+K)

source: _Inspector
ar: _مفتش
fr: _Inspecteur
pt_br: _Inspetor

source: Open GTK Inspector (Ctrl+Shift+I)
ar: افتح مفتشGTK باستخدام (Ctrl+Shift+I)
fr: Ouvrir l'Inspecteur GTK (Ctrl+Maj+I)
nl: GTK-Inspector openen (Ctrl+Shift+I)
pt_br: Abrir o inspetor de GTK (Ctrl+Shift+I)
tr: GTK Inspector'ü aç (Ctrl+Shift+I)

source: Cl_ear
ar: تفريغ
fr: _Effacer
nl: _Wissen
pt_br: L_impar

source: Clear console (Ctrl+K)
ar: مسح وحدة التحكم (Ctrl + K)
fr: Effacer la console (Ctrl+K)
nl: Console wissen (Ctrl+K)
pt_br: Limpar console (Ctrl+K)
tr: Konsolu temizle (Ctrl+K)

source: Import File…
ar: استيراد ملف…
fr: Importer un fichier…
nl: Bestand importeren…
pt_br: Importar arquivo…

source: Bookmarks
ar: إشارات مرجعية
fr: Signets
nl: Bladwijzers
pt_br: Favoritos
tr: Yer İmleri

source: Learn
ar: تعلم
fr: Apprendre
nl: Leren
pt_br: Aprenda
tr: Öğren

source: Developer Documentation
ar: وثائق المطور
fr: Documentation Développeur
nl: Ontwikkelaarsdocumentatie
pt_br: Documentação do desenvolvedor

source: Human Interface Guidelines
ar: إرشادات الواجهة
fr: Directives d'Interface Humaine
pt_br: Diretivas de Interface Humana (HIG)

source: Vala
ar: فالا

source: Blueprint
ar: مخطط

source: Get help
ar: احصل على مساعدة
fr: Obtenir de l'aide
nl: Hulp verkrijgen
pt_br: Obter ajuda
tr: Yardım al

source: Discourse
ar: المناقشة
tr: Söylem

source: Matrix
ar: مصفوفة

source: Platform Tools
ar: أدوات النظام الأساسي
fr: Outils de la plateforme
nl: Platformgereedschap
pt_br: Ferramentas da Plataforma
tr: Platform Araçları

source: Adwaita Demo
ar: عرض Adwaita
fr: Démonstration Adwaita
pt_br: Demonstração Adwaita
tr: Adwaita Demosu

source: GTK Demo
ar: عرض GTK
fr: Démonstration GTK
pt_br: Demonstração GTK
tr: GTK Demosu

source: GTK Widget Factory
ar: مصنع قطع GTK
nl: GTK-widgetfabriek
pt_br: Fábrica de widgets GTK

source: Keyboard Shortcuts
ar: اختصارات لوحة المفاتيح
fr: Raccourcis Clavier
nl: Sneltoetsen
pt_br: Atalhos de teclado
tr: Klavye Kısayolları

source: About Workbench
ar: حول Workbench
fr: À propos de Workbench
nl: Over Workbench
pt_br: Sobre o Workbench
tr: Workbench Hakkında

source: Redo
ar: إعادة الاجراء
fr: Refaire
nl: Opnieuw
pt_br: Refazer

source: Quit
ar: توقف التطبيق
fr: Quitter
nl: Sluiten
pt_br: Sair
tr: Çıkış

source: Library
ar: مكتبة
fr: Bibliothèque
nl: Bibliotheek
pt_br: Biblioteca
tr: Kütüphane

source: <b>Code</b>
pt_br: <b>Código</b>

source: <b>Style CSS</b>
nl: <b>Stijl-CSS</b>
pt_br: <b>Estilo - CSS</b>

source: <b>UI</b>
nl: <b>Interface</b>
pt_br: <b>IU</b>

source: Workbench goal is to let you experiment with GNOME technologies, no matter if tinkering for the first time or building and testing a custom GTK widget.
tr: Workbench'in amacı, ister ilk kez kurcalıyor, ister özel bir GTK widget'ı oluşturup test ediyor olun, GNOME teknolojilerini denemenize izin vermektir.

source: JavaScript for quick and easy scripting
tr: Hızlı ve Kolay scripting için JavaScript

source: Syntax highlighting, undo/redo, autosave
tr: Syntax highlighting, geri al/yeniden yap, otomatik kayıt

source: Side by side editors with live preview on the right and console in the bottom
tr: Sağda canlı önizleme ve altta konsol bulunan yan yana düzenleyiciler

source: Run
tr: Çalıştır

source: Open Console
tr: Konsolu Aç

source: Are you sure you want to discard your changes?
tr: Değişikliklerinizi silmek istediğinizden emin misiniz?

source: Code
tr: Kod

source: Style
tr: Stil

source: Preview
tr: Önizleme

source: Use Light mode
tr: Aydınlık Modu Kullan

source: Use Dark mode
tr: Karanlık Modu Kullan

source: Code - JavaScript
tr: Kod - JavaScript

source: Style - CSS
tr: Stil - CSS

source: Console
tr: Konsol

source: Clear
tr: Temizle

source: This interface can only be previewed as a separate window. We recommend using "Always on Top"
tr: Bu arayüz sadece ayrı bir pencere olarak önizlenebilir. "Her Zaman En Üstte" seçeneğini kullanmanızı öneririz

source: Open File…
tr: Dosya Aç…

source: Human Interface Guidelines (HIG)
tr: İnsan Arayüzü Yönergeleri (Human Interface Guidelines, HIG)

source: UI components
tr: UI bileşenleri

source: Platform components
tr: Platform bileşenleri

source: Reference
tr: Referans
